{
    "ProteinOptional": "Your protein intake averaged {X} g/day this month. This is a solid foundation for maintaining muscle mass and supporting recovery. If you stay within your recommended range, you'll help keep your metabolism strong and your energy levels stable", 
    "ProteinDeficit" : "Your protein intake averaged {X} g/day this month, which is below the recommended range of {Y} g/day. Increasing your protein intake can help support muscle maintenance, recovery, and overall metabolism. Consider incorporating more lean meats, dairy, legumes, and plant-based proteins into your meals to meet your daily needs.",
    "ProteinSurplus" : "Your protein intake averaged {X} g/day this month, exceeding the recommended range of {Y} g/day. While protein is essential for muscle repair and growth, excessive intake may not provide additional benefits and could strain your kidneys over time. Aim to balance your protein consumption with other macronutrients for optimal health.",
    "FatOptional": "Your fat intake averaged {X} g/day this month. This is within a healthy range that supports hormone production, nutrient absorption, and overall cellular function. Maintaining a balanced fat intake can contribute to sustained energy levels and overall well-being.",
    "FatDeficit" : "Your fat intake averaged {X} g/day this month, which is below the recommended range of {Y} g/day. Fats are essential for hormone production, brain health, and nutrient absorption. Consider incorporating healthy fats such as avocados, nuts, seeds, and olive oil into your diet to meet your daily needs.",
    "FatSurplus" : "Your fat intake averaged {X} g/day this month, exceeding the recommended range of {Y} g/day. While fats are vital for various bodily functions, excessive intake can lead to weight gain and other health issues. Aim to balance your fat consumption with other macronutrients and focus on healthy fat sources.",
    "CarbohydratesOptional": "Your carbohydrate intake averaged {X} g/day this month. This is within a healthy range that provides sufficient energy for your daily activities and supports overall bodily functions. Maintaining a balanced carbohydrate intake can help sustain energy levels and promote optimal performance.",
    "CarbohydratesDeficit" : "Your carbohydrate intake averaged {X} g/day this month, which is below the recommended range of {Y} g/day. Carbohydrates are the body's primary energy source, especially for brain function and physical activity. Consider incorporating more whole grains, fruits, and vegetables into your meals to meet your daily carbohydrate needs.",
    "CarbohydratesSurplus" : "Your carbohydrate intake averaged {X} g/day this month, exceeding the recommended range of {Y} g/day. While carbohydrates are essential for energy, excessive intake can lead to weight gain and blood sugar imbalances. Aim to balance your carbohydrate consumption with other macronutrients and focus on complex carbs for sustained energy.",
    "SugarOptional": "Your sugar intake averaged {X} g/day this month. This is within a reasonable range that allows for occasional treats while maintaining overall health. Keeping your sugar intake in check can help prevent energy crashes and support long-term well-being.",
    "SugarDeficit" : "Your sugar intake averaged {X} g/day this month, which is below the recommended limit of {Y} g/day. This is a positive indicator of healthy eating habits, as reducing added sugars can help prevent weight gain, improve heart health, and stabilize energy levels. Keep up the good work!",
    "SugarSurplus" : "Your sugar intake averaged {X} g/day this month, exceeding the recommended limit of {Y} g/day. High sugar consumption can lead to weight gain, energy crashes, and increased risk of chronic diseases such as diabetes and heart disease. Consider reducing your intake of sugary snacks, beverages, and processed foods to improve your overall health.",
    "FiberOptional": "Your fiber intake averaged {X} g/day this month. This is within a healthy range that supports digestive health, helps regulate blood sugar levels, and promotes satiety. Maintaining adequate fiber intake can contribute to overall well-being and disease prevention.",
    "FiberDeficit" : "Your fiber intake averaged {X} g/day this month, which is below the recommended range of {Y} g/day. Adequate fiber intake is essential for digestive health, blood sugar regulation, and satiety. Consider incorporating more fruits, vegetables, whole grains, and legumes into your diet to meet your daily fiber needs.",
    "FiberSurplus" : "Your fiber intake averaged {X} g/day this month, exceeding the recommended range of {Y} g/day. While fiber is important for digestive health, excessive intake can lead to gastrointestinal discomfort such as bloating and gas. Aim to balance your fiber consumption and ensure adequate hydration to support digestion.",
    "CaloriesOptional": "Your calorie intake averaged {X} kcal/day this month. This is within a healthy range that supports your energy needs and overall well-being. Maintaining a balanced calorie intake can help you achieve your fitness goals and sustain your daily activities.",
    "CaloriesDeficit" : "Your calorie intake averaged {X} kcal/day this month, which is below the recommended range of {Y} kcal/day. Consuming too few calories can lead to fatigue, nutrient deficiencies, and muscle loss. Consider increasing your calorie intake with nutrient-dense foods to support your energy needs and overall health.",
    "CaloriesSurplus" : "Your calorie intake averaged {X} kcal/day this month, exceeding the recommended range of {Y} kcal/day. Consuming excess calories can lead to weight gain and associated health issues. Aim to balance your calorie intake with your energy expenditure and focus on nutrient-dense foods to support overall well-being.",
    "DeficitForWeightLoss": "Your calorie intake averaged {X} kcal/day this month, putting you in a healthy deficit compared to your recommended range of {Y} kcal/day. Great work — this steady deficit is exactly what supports gradual, sustainable weight loss. Keep up the consistent progress!",
    "DeficitForWeightGain": "Your calorie intake averaged {X} kcal/day this month, which is below your recommended range of {Y} kcal/day. You're putting in effort - now it's time to support your body with a bit more fuel. Increasing your intake will help you build strength, recover better, and move closer to your weight-gain goals.",
    "SurplusForWeightGain": "Your calorie intake averaged {X} kcal/day this month, placing you in a healthy surplus above your recommended range of {Y} kcal/day. Nice job,  this surplus helps your body build muscle and gain weight effectively. Keep fueling consistently!",
    "SurplusForWeightLoss": "Your calorie intake averaged {X} kcal/day this month, which is above your recommended range of {Y} kcal/day. Awareness is the first win and you've already achieved that. With a few small adjustments, you can create the steady deficit that supports healthy, long-term weight loss."
}